{
    "name":  "CIS Benchmark MacOS 14.0 Sonoma",
    "description":  "Settings Catalog\nBased on CIS Benchmark Apple macOS 14.0  Sonoma v1.0.0",
    "platforms":  "macOS",
    "technologies":  "mdm,appleRemoteManagement",
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.mcx_com.apple.mcx-accounts",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx_disableguestaccount",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx_disableguestaccount_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.mcx.filevault2_com.apple.mcx.filevault2",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx.filevault2_enable",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx.filevault2_enable_0",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.mcx_com.apple.mcx-fdefilevaultoptions",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx_dontallowfdedisable",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx_dontallowfdedisable_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.security.firewall_com.apple.security.firewall",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.security.firewall_enablefirewall",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.security.firewall_enablefirewall_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.security.firewall_enablelogging",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.security.firewall_enablelogging_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.security.firewall_enablestealthmode",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.security.firewall_enablestealthmode_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.security.firewall_loggingoption",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.security.firewall_loggingoption_2",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.applicationaccess_com.apple.applicationaccess",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowairplayincomingrequests",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowairplayincomingrequests_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowbluetoothsharingmodification",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowbluetoothsharingmodification_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowdiagnosticsubmission",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowdiagnosticsubmission_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowfilesharingmodification",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowfilesharingmodification_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowinternetsharingmodification",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowinternetsharingmodification_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowitunesfilesharing",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowitunesfilesharing_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowpasswordproximityrequests",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowpasswordproximityrequests_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowprintersharingmodification",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowprintersharingmodification_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowrapidsecurityresponseinstallation",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowrapidsecurityresponseinstallation_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowremoteappleeventsmodification",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowremoteappleeventsmodification_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowremotescreenobservation",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowremotescreenobservation_false",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.applicationaccess_allowtimemachinebackup",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.applicationaccess_allowtimemachinebackup_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.softwareupdate_com.apple.softwareupdate",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.softwareupdate_automaticcheckenabled",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.softwareupdate_automaticcheckenabled_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.softwareupdate_automaticdownload",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.softwareupdate_automaticdownload_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.softwareupdate_automaticallyinstallappupdates",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.softwareupdate_automaticallyinstallappupdates_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.softwareupdate_automaticallyinstallmacosupdates",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.softwareupdate_automaticallyinstallmacosupdates_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.softwareupdate_criticalupdateinstall",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.softwareupdate_criticalupdateinstall_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.mcx_com.apple.mcx-energysaver",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx_com.apple.energysaver.desktop.acpower",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "groupSettingCollectionValue":  [
                                                                                                                                                  {
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.mcx_com.apple.energysaver.desktop.acpower_wake on lan",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.mcx_com.apple.energysaver.desktop.acpower_wake on lan_0",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  }
                                                                                                                                              ]
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx_destroyfvkeyonstandby",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx_destroyfvkeyonstandby_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx_com.apple.energysaver.portable.batterypower",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "groupSettingCollectionValue":  [
                                                                                                                                                  {
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.mcx_com.apple.energysaver.portable.batterypower_wake on lan",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.mcx_com.apple.energysaver.portable.batterypower_wake on lan_0",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  }
                                                                                                                                              ]
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx_com.apple.energysaver.portable.acpower",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "groupSettingCollectionValue":  [
                                                                                                                                                  {
                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                      "children":  [
                                                                                                                                                                       {
                                                                                                                                                                           "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                                                                                           "settingDefinitionId":  "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on lan",
                                                                                                                                                                           "settingInstanceTemplateReference":  null,
                                                                                                                                                                           "choiceSettingValue":  {
                                                                                                                                                                                                      "settingValueTemplateReference":  null,
                                                                                                                                                                                                      "value":  "com.apple.mcx_com.apple.energysaver.portable.acpower_wake on lan_0",
                                                                                                                                                                                                      "children":  [

                                                                                                                                                                                                                   ]
                                                                                                                                                                                                  }
                                                                                                                                                                       }
                                                                                                                                                                   ]
                                                                                                                                                  }
                                                                                                                                              ]
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.screensaver_com.apple.screensaver",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.screensaver_askforpassword",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.screensaver_askforpassword_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.screensaver_askforpassworddelay",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  0
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.screensaver_loginwindowidletime",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  15
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.screensaver_modulename",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "your_module_here"
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.mcxmenuextras_com.apple.mcxmenuextras",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcxmenuextras_bluetooth.menu",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcxmenuextras_bluetooth.menu_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcxmenuextras_wwan.menu",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcxmenuextras_wwan.menu_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                                                 "settingDefinitionId":  "com.apple.mcx.timemachine_com.apple.mcx.timemachine",
                                                 "settingInstanceTemplateReference":  null,
                                                 "groupSettingCollectionValue":  [
                                                                                     {
                                                                                         "settingValueTemplateReference":  null,
                                                                                         "children":  [
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx.timemachine_autobackup",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "choiceSettingValue":  {
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "com.apple.mcx.timemachine_autobackup_true",
                                                                                                                                         "children":  [

                                                                                                                                                      ]
                                                                                                                                     }
                                                                                                          },
                                                                                                          {
                                                                                                              "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                                                                              "settingDefinitionId":  "com.apple.mcx.timemachine_backupdesturl",
                                                                                                              "settingInstanceTemplateReference":  null,
                                                                                                              "simpleSettingValue":  {
                                                                                                                                         "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                                                                         "settingValueTemplateReference":  null,
                                                                                                                                         "value":  "your_backup_url"
                                                                                                                                     }
                                                                                                          }
                                                                                                      ]
                                                                                     }
                                                                                 ]
                                             }
                     }
                 ]
}
